# 野外训练家称号
Call_Name = ['短裤小子','精英训练家','大姐姐','怪兽狂','趁火打劫者','空手道王','祈祷师','赌徒','超能力者','绅士','吉卜赛杂耍艺人','光头男','垂钓者','电气摇滚团','电工大叔','养鸟人','流浪研究员','水手','飙车族','童子军','迷你裙','捕虫少年','驯兽师','登山男','泳裤小伙子','理科男','露营少年','补习班学生','滑雪者','比基尼姐姐','和尚','单板玩家','和服女孩','千金小姐','富家少爷','遗迹迷','营火专家','昆虫狂','对战少女','忍者小子','阳伞姐姐','香氛姐姐','服务生','资深训练家','艺术家','慢跑者','宝可梦培育家','宝可梦小朋友','一般路过的训练家','兴趣使然的训练家']
# 野外训练家名称
First_Name = ['吴','小','阿','路','沙','大木','御龙','板','赵','钱','孙','李','周','吴','郑','王','冯','陈','褚','卫','蒋','沈','韩','杨','朱','秦','尤','许','何','吕','施','张','孔','曹','严','华','金','魏','陶','姜','戚','谢','邹','喻','柏','水','窦','章','云','苏','潘','葛','奚','范','彭','郎','鲁','韦','昌','马','苗','凤','花','方','俞','任','袁','柳']
Last_Name = ['一','二','三','四','五','六','七','八','九','十','红','橙','黄','绿','青','蓝','紫','白','黑','梅','兰','竹','菊','路','疑','风','枫','娜','梦']
